Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.Members Property
 Gets the members of the analysis bar.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisMember> Members { get; set; }
Public Property Members As List(Of AnalysisMember)
	Get
	Set
Property Value
Type: List<AnalysisMember>
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace